Python 101 ep.2

พื้นฐาน Python ทั่วไปเพียงพอกับการประยุกต์ใช้ในการเขียนโปรแกรม GUI แบบง่ายๆเพื่อเขียนโปรแกรมบันทึกความรู้ที่เรียนมา
-โมดูล/package/ไลบรารี่คืออะไร
-built -in library #ข้อมูลพิเศษที่มีอยู่แล้ว
-ตัวเเปรเก็บข้อมูล
-print แบบพิเศษ (.format)
-basic tkinter สร้างโปรแกรมที่มีปุ่ม มีช่องกรอกข้อมูล
-บันทึกข้อมูลลงในไฟล์ CVS
#โมดูล ไฟล์ 1 ไฟล์ที่เก็บไว้  #package Library ข้อมูลที่เราเขียนไว้แล้ว

#ตัวแปรเช่น name = 'ชื่อ' การประกาศตัวแปร
name.lower  ตัวพิมพ์เล็ก
name.upper   ตัวพิมพ์ใหญ่
#ตัวแปรพิเศษ
